[
    {
        "title": "Stock market today: Indexes pop after Nvidia's blowout earnings report",
        "date": "2024-05-23T13:38:21Z",
        "source": "Business Insider",
        "text": "US stocks moved higher on Thursday, with investors cheering another blowout earnings report from chip giant Nvidia. \r\nThe company, whose chips are at the heart of the artificial intelligence boom, be… [+2044 chars]"
    },
    {
        "title": "Buying a piece of Nvidia is about to get a whole lot cheaper",
        "date": "2024-05-23T11:08:09Z",
        "source": "Business Insider",
        "text": "Nvidia CEO Jensen Huang.Vincent Thian/AP\r\n<ul><li>The price of a single Nvidia share is about to plummet, making the AI stock far more affordable.</li><li>The microchip giant's first-quarter earnings… [+3182 chars]"
    },
    {
        "title": "The Magnificent 7 companies are worth a combined $14 trillion — here's how much their CEOs make",
        "date": "2024-05-18T12:06:01Z",
        "source": "Business Insider",
        "text": "Mark Zuckerberg with Satya Nadella, Jensen Huang, Sundar Pichai, Andy Jassy, Tim Cook, and Elon Musk are CEOs of the \"Magnificent Seven.\"Getty Images\r\n<ul><li>The \"Magnificent Seven\" companies includ… [+5824 chars]"
    },
    {
        "title": "Nvidia CEO Jensen Huang is now worth $107 billion, making him the 13th-richest person",
        "date": "2024-06-06T11:22:19Z",
        "source": "Business Insider",
        "text": "Jensen Huang at the Taipei Dome in Taipei, Taiwan.Gene Wang/Getty Images\r\n<ul><li>Nvidia's Jensen Huang has zoomed up Bloomberg's rich list to rank 13th with a $107 billion fortune.</li><li>Only Mich… [+2104 chars]"
    },
    {
        "title": "Nvidia CEO Jensen Huang’s net worth surges to $90B on demand for AI chips",
        "date": "2024-05-27T13:02:27Z",
        "source": "ReadWrite",
        "text": "Nvidia CEO and co-founder Jensen Huang saw his net worth significantly increase on Thursday (May 23) as shares of his semiconductor company, a key player in the artificial intelligence sector, hit a … [+2398 chars]"
    },
    {
        "title": "An elite hedge fund bought 1 million GameStop shares before the meme stock's 400% surge",
        "date": "2024-05-15T15:19:09Z",
        "source": "Business Insider",
        "text": "Renaissance Technologies bought 1 million GameStop shares last quarter.Reuters\r\n<ul><li>A top hedge fund built a GameStop stake from scratch last quarter ahead of the meme stock's surge.</li><li>Rena… [+2498 chars]"
    },
    {
        "title": "Nvidia just keeps hitting it out of the park",
        "date": "2024-05-22T22:33:16Z",
        "source": "Business Insider",
        "text": "Nvidia exceeded expectations thanks to ongoing demand for its AI chips.Justin Sullivan/Getty\r\n<ul><li>Nvidia's Q1 revenue hit a record $26 billion, surpassing analyst estimates.</li><li>Nvidia also g… [+2322 chars]"
    },
    {
        "title": "Nvidia gave CEO Jensen Huang a 60% pay hike to $34 million last year",
        "date": "2024-05-15T04:40:00Z",
        "source": "Business Insider",
        "text": "Jensen Huang, CEO of Nvidia.Sam Yeh/AFP/Getty Images\r\n<ul><li>Nvidia CEO Jensen Huang received a $34.2 million compensation package in fiscal 2024.</li><li>Huang's pay rose 60% from 2023, driven by N… [+2211 chars]"
    },
    {
        "title": "Nvidia's Jensen Huang receives a rockstar reception in Taiwan amid a record high stock market",
        "date": "2024-05-31T05:45:26Z",
        "source": "Business Insider",
        "text": "Nvidia CEO Jensen Huang in one of his many leather jackets.Justin Sullivan/Getty Images\r\n<ul><li>Nvidia CEO Jensen Huang's Taiwan visit boosts local stock market amid China tensions.</li><li>Huang's … [+3580 chars]"
    },
    {
        "title": "A global labor shortage will send tech stocks soaring, with the sector poised to grow to 50% of the total stock market, Fundstrat says",
        "date": "2024-05-23T17:06:17Z",
        "source": "Business Insider",
        "text": "A global labor shortage of about 80 million workers by the end of 2030 is going to send technology stocks soaring, according to Fundstrat's Tom Lee. \r\nLee said in a video on Wednesday that he expects… [+1934 chars]"
    },
    {
        "title": "Stock market today: US indexes rally after cool inflation data",
        "date": "2024-05-31T20:12:43Z",
        "source": "Business Insider",
        "text": "US indexes finished mostly higher on Friday after a key inflation metric left investors encouraged.\r\nThe S&amp;P 500 and Dow Jones Industrial Average rose, while the Nasdaq Composite was flat. Nvidia… [+1614 chars]"
    },
    {
        "title": "ETFs to Tap on NVIDIA's 10-for-1 Stock Split Retail Frenzy",
        "date": "2024-06-05T14:00:00Z",
        "source": "Yahoo Entertainment",
        "text": "NVIDIA NVDA has been on a solid run with no signs of a slowdown. After blockbuster results, the AI chipmaker is making a series of new record highs on the upcoming 10-for-1 stock split, which will ma… [+5489 chars]"
    },
    {
        "title": "Nvidia Hits $3 Trillion Market Cap On Back of AI Boom",
        "date": "2024-06-05T22:30:00Z",
        "source": "Slashdot.org",
        "text": "Nvidia's milestone is the latest stunning mark in a run that has seen the stock soar more than 3,224% over the past five years. The company will split its stock 100-for-1 later this month. Apple was … [+622 chars]"
    },
    {
        "title": "Stocks splits are usually bullish. Here are 8 expensive stocks that could get a boost by following Nvidia's 10-for-1 move.",
        "date": "2024-05-27T12:15:01Z",
        "source": "Business Insider",
        "text": "Nvidia last week became the eighth company this year to enact a forward stock split, following the footsteps of mega corporations Walmart in January and Chipotle in March.\r\nThe company will give its … [+2356 chars]"
    },
    {
        "title": "The Walmart heirs have added more than $53 billion to their combined net worth this year — second only to Nvidia CEO Jensen Huang",
        "date": "2024-06-07T16:13:11Z",
        "source": "Business Insider",
        "text": "Rob, Alice, and Jim Walton at a Walmart annual meeting in Fayetteville, Arkansas.Rick T. Wilking/Getty Images\r\n<ul><li>The heirs to Walmart founder Sam Walton have added $53.7 billion to their combin… [+1556 chars]"
    },
    {
        "title": "Nvidia Rallies on Astronomical Revenue Growth and Stock Split. Is It Too Late to Buy the Stock?",
        "date": "2024-05-29T11:50:00Z",
        "source": "Yahoo Entertainment",
        "text": "If you click 'Accept all', we and our partners, including 237 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+678 chars]"
    },
    {
        "title": "Nvidia's big day is here",
        "date": "2024-05-22T13:36:59Z",
        "source": "Business Insider",
        "text": "Nvidia CEO Jensen Huang.I-Hwa Cheng/AFP/Getty Images\r\n<ul><li>This post originally appeared in the Insider Today newsletter.</li><li>You can sign up for Business Insider's daily newsletter here.</li>… [+6633 chars]"
    },
    {
        "title": "A single customer made up 19% of Nvidia's revenue last year. UBS thinks it's Microsoft.",
        "date": "2024-05-31T14:35:33Z",
        "source": "Business Insider",
        "text": "Slaven Vlasic/Getty Images for The New York Times; Chelsea Jia Feng/BI\r\n<ul>\n<li>Recent disclosures from Nvidia highlight just how concentrated its customer base is.</li>\n<li>The company said just tw… [+2111 chars]"
    },
    {
        "title": "Apple Becomes $3 Trillion Company Again, But Nvidia Steals the Moment",
        "date": "2024-06-05T20:29:18Z",
        "source": "MacRumors",
        "text": "Fans of large numbers will be happy to know that Apple became a $3 trillion company again today based on market cap, which is the total value of all of the company's outstanding shares. However, chip… [+1010 chars]"
    },
    {
        "title": "Nvidia jumps ahead of itself and reveals next-gen “Rubin” AI chips in keynote tease",
        "date": "2024-06-03T17:13:10Z",
        "source": "Ars Technica",
        "text": "Enlarge/ Nvidia's CEO Jensen Huang delivers his keystone speech ahead of Computex 2024 in Taipei on June 2, 2024.\r\n18\r\nOn Sunday, Nvidia CEO Jensen Huang reached beyond Blackwell and revealed the com… [+4320 chars]"
    },
    {
        "title": "Startups taking on Nvidia face an uphill battle, but the dominant AI chipmaker faces another real threat",
        "date": "2024-06-07T14:21:21Z",
        "source": "Business Insider",
        "text": "Chelsea Jia Feng/BI\r\n<ul><li>This post originally appeared in the Insider Today newsletter.</li><li>You can sign up for Business Insider's daily newsletter here.</li></ul>Happy Friday! Yes, there are… [+6797 chars]"
    },
    {
        "title": "Nvidia is no household name — but may soon overtake Microsoft and Apple",
        "date": "2024-05-31T09:00:37Z",
        "source": "Business Insider",
        "text": "Nvidia is based in Santa Clara, California.Justin Sullivan/Getty Images\r\n<ul><li>Nvidia could soon become the world's most valuable company.</li><li>That's despite the chipmaker being no household na… [+3154 chars]"
    },
    {
        "title": "Nvida emails: Elon Musk diverting Tesla GPUs to his other companies",
        "date": "2024-06-04T16:07:05Z",
        "source": "Ars Technica",
        "text": "Enlarge/ Tesla will have to rely on its Dojo supercomputer for a while longer after CEO Elon Musk diverted 12,000 Nvidia GPU clusters to X instead.\r\n161\r\nElon Musk is yet again being accused of diver… [+3980 chars]"
    },
    {
        "title": "Stock market today: Dow closes above 40,000 for the first time as latest inflation data fuels big weekly gains",
        "date": "2024-05-17T20:08:33Z",
        "source": "Business Insider",
        "text": "The Dow Jones Industrial Average closed above 40,000 for the first time on Friday, closing out a strong week of gains fueled by upbeat inflation data midweek. \r\nThe index secured the closing mileston… [+1729 chars]"
    },
    {
        "title": "Nvidia CEO Jensen Huang is the 'man of the year': Investor",
        "date": "2024-05-22T21:29:02Z",
        "source": "Yahoo Entertainment",
        "text": "Nvidia (NVDA) shares are popping in Wednesday's extended trading after beating earnings estimates for its fiscal first-quarter 2025, posting revenue of $26 billion (expected $24.69 billion) and adjus… [+5817 chars]"
    },
    {
        "title": "Nvidia CEO Jensen Huang says robots are the next wave of AI — and 2 kinds will dominate",
        "date": "2024-06-03T09:01:41Z",
        "source": "Business Insider",
        "text": "Jensen Huang said the physical AI that powers robots is \"the next wave of AI.\"Justin Sullivan/Getty\r\n<ul><li>Nvidia CEO Jensen Huang highlighted robots — again — at a Taiwan tech conference Sunday.</… [+2035 chars]"
    },
    {
        "title": "Nvidia Hits the $3T Market Cap Club, Passing Apple, Trailing Only Microsoft",
        "date": "2024-06-07T02:33:48Z",
        "source": "Spyglass.org",
        "text": "Back in March, I wrote the following footnote in a post about NVIDIA's just-announced Blackwell chips:\r\nNVIDIA is getting dangerously close to passing Apple -- yes, Apple -- in market cap. Forget Int… [+2971 chars]"
    },
    {
        "title": "Elon Musk ordered Nvidia to prioritize chips for X, xAI: CNBC",
        "date": "2024-06-04T13:57:59Z",
        "source": "Yahoo Entertainment",
        "text": "Tesla (TSLA) CEO Elon Musk reportedly ordered Nvidia (NVDA) to ship out and divert AI chips originally meant for Tesla to X and Musk's xAI startup, according to emails obtained by CNBC. The Morning B… [+2902 chars]"
    },
    {
        "title": "A legendary hedge fund exited its GameStop bet before the meme stock's 550% spike",
        "date": "2024-05-16T12:31:12Z",
        "source": "Business Insider",
        "text": "Paul Tudor Jones' hedge fund exited a GameStop position last quarter, ahead of the stock's epic surge.John Minchillo/AP\r\n<ul><li>A storied hedge fund exited its GameStop wager last quarter, before th… [+3113 chars]"
    },
    {
        "title": "Stock market's record-setting rebound may have further to go",
        "date": "2024-05-17T21:52:30Z",
        "source": "Yahoo Entertainment",
        "text": "By Lewis Krauskopf\r\nNEW YORK (Reuters) - A rebound that has taken the U.S. stock market to record highs this week may have further to run, if history is any guide.\r\nFresh signs of a cooling economy c… [+4145 chars]"
    },
    {
        "title": "Nvidia Announces Financial Results for First Quarter Fiscal 2025",
        "date": "2024-05-22T20:26:01Z",
        "source": "Nvidia.com",
        "text": "<ul><li>Record quarterly revenue of $26.0 billion, up 18% from Q4 and up 262% from a year ago </li><li>Record quarterly Data Center revenue of $22.6 billion, up 23% from Q4 and up 427% from a year ag… [+34245 chars]"
    },
    {
        "title": "The Dow Jones hits 40,000 for the first time. What to know about this major milestone",
        "date": "2024-05-16T20:15:57Z",
        "source": "NPR",
        "text": "Traders on the floor of the New York Stock Exchange in New York City on May 16, 2024, when the Dow hit 40,000 points for the first time ever.\r\nSpencer Platt/Getty Images\r\nThe Dow Jones Industrial Ave… [+4115 chars]"
    },
    {
        "title": "Nvidia: Why investors are shorting the stock ahead of its split",
        "date": "2024-06-06T20:56:14Z",
        "source": "Yahoo Entertainment",
        "text": "Nvidia's (NVDA) market cap briefly surpassed $3 trillion ahead of the company's planned 10-for-1 stock split on Friday after the market close. S3 Partners Managing Director Ihor Dusaniwsky joins Mark… [+7696 chars]"
    },
    {
        "title": "NVIDIA Splits 10-to-1; Non-farm Payrolls on Deck for Friday",
        "date": "2024-06-06T22:16:00Z",
        "source": "Yahoo Entertainment",
        "text": "Thursday, June 6th, 2024\r\nMarket indices took a breather today. Only the Dow closed in the green on a tepid trading day overall, +0.20%, while the S&amp;P 500 finished -0.02%, the Nasdaq down -0.09% … [+3176 chars]"
    },
    {
        "title": "Nvidia overtakes AAPL to exceed $3T value, wins an antitrust investigation",
        "date": "2024-06-06T11:06:46Z",
        "source": "9to5Mac",
        "text": "Nvidia has overtaken AAPL in the market cap stakes, as its valuation exceeded $3T. The company’s rise in value has been truly spectacular, increasing from $2T back in February to more than $3T just f… [+2475 chars]"
    },
    {
        "title": "Michael Burry and John Paulson hit the jackpot when they called the housing crash. Now they're betting on gold.",
        "date": "2024-05-19T09:07:01Z",
        "source": "Business Insider",
        "text": "Michael Burry of \"The Big Short\" fame.Astrid Stawiarz/Getty Images\r\n<ul><li>Michael Burry of \"The Big Short\" fame revealed an $8 million wager on gold this week.</li><li>The renowned investor bought … [+2974 chars]"
    },
    {
        "title": "Nvidia tops earnings, House considers crypto framework: Market Domination Overtime",
        "date": "2024-05-22T22:05:10Z",
        "source": "Yahoo Entertainment",
        "text": "Nvidia's (NVDA) fiscal first-quarter earnings results are the biggest story in this installment of Market Domination Overtime with Julie Hyman and Josh Lipton. The Dow Jones Industrial Average (^DJI)… [+28555 chars]"
    },
    {
        "title": "Apple regains $3 trillion valuation, creeps up on Microsoft",
        "date": "2024-06-05T13:33:37Z",
        "source": "AppleInsider",
        "text": "With Nvidia hot on its heels, and Microsoft ahead, Apple stock gains in recent weeks has returned the company to a $3 trillion valuation at market open on Wednesday morning.\r\nApple's stock has seen a… [+1547 chars]"
    },
    {
        "title": "Render (RNDR) Price Prediction 2024 – Next AI Crypto to Watch?",
        "date": "2024-05-08T17:25:04Z",
        "source": "ReadWrite",
        "text": "Render (RNDR) outperformed other top AI cryptos in the last seven days with an impressive 40% pump. While other notable AI coins such as NEAR, GRT, and TAO also experienced gains, their rallies were … [+2806 chars]"
    },
    {
        "title": "We're on track for a soft economic landing, but it still feels like the economy stinks",
        "date": "2024-06-06T14:39:19Z",
        "source": "Business Insider",
        "text": "Former Fed economist Claudia Sahm thinks the Fed is the biggest risk to a soft landing.Getty Images\r\n<ul><li>This post originally appeared in the Insider Today newsletter.</li><li>You can sign up for… [+6894 chars]"
    },
    {
        "title": "Nvidia stock boosts the Nasdaq above 17,000",
        "date": "2024-05-28T15:04:00Z",
        "source": "Quartz India",
        "text": "The tech-heavy Nasdaq climbed above 17,000 points Tuesday morning as AI stock Nvidia continued to rise. With this move, the index has made a record for the third consecutive week. \r\nNvidia shares sur… [+403 chars]"
    },
    {
        "title": "Nvidia stock is the new gold",
        "date": "2024-05-13T14:00:00Z",
        "source": "Quartz India",
        "text": "Almost one third of respondents in a new Bloomberg Markets Live Pulse Survey said they are turning to tech stocks, not gold, to shield themselves from inflation. And leading that pack is AI chipmaker… [+1627 chars]"
    },
    {
        "title": "Dell stock falls off despite a Q1 earnings, revenue beat",
        "date": "2024-05-30T20:18:09Z",
        "source": "Yahoo Entertainment",
        "text": "Dell Technologies (DELL) stock tumbles in Thursday's after-hours trading even though the computer company shared an all-around earnings beat in its first quarter: $22.24 billion in revenue (expected … [+3250 chars]"
    },
    {
        "title": "5 cheap graphics cards you should buy instead of the RTX 4060",
        "date": "2024-05-14T11:30:54Z",
        "source": "Digital Trends",
        "text": "Jacob Roach / Digital Trends\r\nIf you’re in the market for a budget GPU, the RTX 4060 is one of the best graphics cards you can buy. It’s available for a reasonable price, offers solid 1080p performan… [+7018 chars]"
    },
    {
        "title": "Short sellers are betting billions against Nvidia stock",
        "date": "2024-06-07T14:34:05Z",
        "source": "Quartz India",
        "text": "Short sellers are betting billions more against Nvidia than they are Apple and Tesla. Outstanding short bets against Nvidia total $34 billion, S3 Partners data reviewed by Reuters shows. Thats nearly… [+1552 chars]"
    },
    {
        "title": "Nvidia earnings stun the street and the stock is soaring",
        "date": "2024-05-23T19:33:34Z",
        "source": "Quartz India",
        "text": "Our free, fast, and fun briefing on the global economy, delivered every weekday morning."
    },
    {
        "title": "Nvidia stock climbs another 7% after reporting record revenues",
        "date": "2024-05-23T11:54:00Z",
        "source": "Quartz India",
        "text": "Shares of Nvidia climbed 7% in pre-market trading on Thursday to $1,016 a share following its hotter-than-expected first-quarter earnings report.\r\nThe chipmakers stock price passed $1,000 for the fir… [+2261 chars]"
    },
    {
        "title": "Nvidia stock has all-time closing high in its crosshairs",
        "date": "2024-05-16T18:05:00Z",
        "source": "Quartz India",
        "text": "Our free, fast, and fun briefing on the global economy, delivered every weekday morning."
    },
    {
        "title": "Nvidia stock opens above $1,000 after record earnings",
        "date": "2024-05-23T14:05:00Z",
        "source": "Quartz India",
        "text": "After delivering its highly anticipated first-quarter earnings report, Nvidias stock price opened at above $1,000 Thursday morning.\r\nNvidias shares were up 9% at around $1,031, after it crossed the $… [+2210 chars]"
    },
    {
        "title": "Nvidia's big stock split is today. Here’s what to know",
        "date": "2024-06-07T13:35:00Z",
        "source": "Quartz India",
        "text": "After reaching a record high on Tuesday, Nvidia is looking ahead to its stock split, which will begin on Friday. \r\nThe AI chipmakers stock was down 1.6% shortly after markets opened, to $1,189 per sh… [+2538 chars]"
    },
    {
        "title": "Nvidia reports Q1 revenue up 262% YoY to $26.04B, vs. $24.65B est., forecasts Q2 revenue above estimates, and announces a 10-for-1 stock split (Kif Leswing/CNBC)",
        "date": "2024-05-22T20:32:54Z",
        "source": "Techmeme.com",
        "text": "About This Page\r\nThis is a Techmeme archive page.\r\nIt shows how the site appeared at 4:32 PM ET, May 22, 2024.\r\nThe most current version of the site as always is available at our home page.\r\nTo view … [+166 chars]"
    },
    {
        "title": "The RTX 5080 may be a disappointing upgrade after all",
        "date": "2024-06-03T23:13:22Z",
        "source": "Digital Trends",
        "text": "Jacob Roach / Digital Trends\r\nAlthough Nvidia hasn’t said much about its upcoming RTX 50-series graphics cards during Computex, they’re coming, and we just got a new rumor about their potential specs… [+3723 chars]"
    },
    {
        "title": "NVIDIA has its \"iPhone moment\" with a $3 trillion market valuation to be the second-most valuable company ahead of Apple",
        "date": "2024-06-06T11:11:20Z",
        "source": "Windows Central",
        "text": "What you need to know\r\n<ul><li>NVIDIA is now the second most valuable company in the world, ahead of Apple, and has over $3 trillion in market capitalization.</li><li>The chip maker's success can be … [+3097 chars]"
    },
    {
        "title": "The AI stock backed by Nvidia is on a tear just like the chipmaker",
        "date": "2024-05-29T14:40:00Z",
        "source": "Quartz India",
        "text": "While chipmaker Nvidia sees its stock rally to new highs this year, one of the four stocks it publicly owns is also feeling the rush.\r\nSoundHound AI, an artificial intelligence-powered voice and conv… [+1635 chars]"
    },
    {
        "title": "Nvidia overtakes Apple to become world’s second-most valuable company",
        "date": "2024-06-06T01:29:23Z",
        "source": "Al Jazeera English",
        "text": "Nvidia has overtaken Apple to become the worlds second-most valuable company, with furious demand for the chipmakers shares taking its valuation to over $3 trillion.\r\nShares of Nvidia gained 5.2 perc… [+1329 chars]"
    },
    {
        "title": "Buy Dell or Hewlett-Packard stock if you missed out on Nvidia, strategist says",
        "date": "2024-06-05T09:00:00Z",
        "source": "Quartz India",
        "text": "David Dietze, managing principal and senior investment strategist of Peapack Private Wealth Management, spoke with Quartz for the latest installment of our Smart Investing video series.\r\nWatch the in… [+4083 chars]"
    },
    {
        "title": "Nvidia shares keeps hitting record highs before a big stock split. Here’s what to know",
        "date": "2024-06-04T16:16:00Z",
        "source": "Quartz India",
        "text": "Nvidias share price soared to a record high of $1158.58 on Tuesday morning ahead of its stock split that will begin on Friday.\r\nThe chipmakers in-demand Hopper chips, which power some of the worlds m… [+2345 chars]"
    },
    {
        "title": "Corporate America is going through a middle-management meltdown",
        "date": "2024-05-23T12:47:48Z",
        "source": "Business Insider",
        "text": "The author's boss was toxic.Simplehappyart/Getty Images\r\n<ul><li>This post originally appeared in the Insider Today newsletter.</li><li>You can sign up for Business Insider's daily newsletter here.</… [+6645 chars]"
    },
    {
        "title": "Nvidia CEO Jensen Huang’s net worth ballooned $8 billion in one day",
        "date": "2024-05-24T16:43:00Z",
        "source": "Quartz India",
        "text": "Nvidia stock has had a red-hot week following a stellar first-quarter earnings report. And the chipmakers CEO is already reaping the rewards.\r\nJensen Huangs net worth soared by more than $8 billion o… [+1732 chars]"
    },
    {
        "title": "Nvidia stock pops 7% to top $1,000 after earnings beat forecasts, it announces stock split and dividend hike",
        "date": "2024-05-22T20:24:05Z",
        "source": "Yahoo Entertainment",
        "text": "If you click 'Accept all', we and our partners, including 238 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+678 chars]"
    },
    {
        "title": "Nvidia is close to surpassing Apple as the world's second-most-valuable company",
        "date": "2024-05-29T15:30:35Z",
        "source": "Quartz India",
        "text": "Nvidia could soon dethrone Apple as the second-most-valuable global company by market cap.\r\nThe AI chipmakers stock price rose another 20% over the past five days as the company continued to prove it… [+1216 chars]"
    },
    {
        "title": "GameStop meme stock mania, Nvidia earnings, and Bitcoin misses the party: Markets news roundup",
        "date": "2024-05-18T13:00:00Z",
        "source": "Quartz India",
        "text": "Steve Sosnick, chief strategist of Interactive Brokers, spoke with Quartz for the latest installment of our Smart Investing video series.\r\nWatch the interview above and check out the transcript below… [+95 chars]"
    },
    {
        "title": "Nvidia beat Wall Street's expectations again in first quarter results",
        "date": "2024-05-22T20:32:28Z",
        "source": "Quartz India",
        "text": "Nvidia beat Wall Streets expectations again, reporting a first quarter revenue of $26 million for fiscal year 2025 up 262% from a year ago.\r\nAhead of its earnings report, the chipmakers share price w… [+1408 chars]"
    },
    {
        "title": "Nvidia stock is close to an all-time high with earnings around the corner",
        "date": "2024-05-16T14:39:00Z",
        "source": "Quartz India",
        "text": "Nvidias hot streak is continuing as the chipmakers stock barrels toward a record high ahead of first quarter earnings next week.\r\nThe chipmakers shares were up 0.6% in pre-market trading Thursday mor… [+1709 chars]"
    },
    {
        "title": "Buy Nvidia and Apple stock but skip McDonald's and Starbucks, analyst says",
        "date": "2024-05-08T17:13:00Z",
        "source": "Quartz India",
        "text": "Rohan Reddy, director of research at Global X ETFs, spoke with Quartz for the latest installment of our Smart Investing video series.\r\nWatch the interview above and check out the transcript below. Th… [+4065 chars]"
    },
    {
        "title": "Nvidia stock pulls back at open Thursday, sending market value below $3 trillion",
        "date": "2024-06-06T14:10:14Z",
        "source": "Yahoo Entertainment",
        "text": "If you click 'Accept all', we and our partners, including 238 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+678 chars]"
    },
    {
        "title": "Nvidia stock reaches all-time high as company closes in on $3 trillion market cap",
        "date": "2024-06-05T18:57:48Z",
        "source": "Yahoo Entertainment",
        "text": "If you click 'Accept all', we and our partners, including 238 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+678 chars]"
    },
    {
        "title": "4 takeaways from Nvidia's first-quarter earnings",
        "date": "2024-05-23T17:58:00Z",
        "source": "Quartz India",
        "text": "After delivering its closely watched first-quarter earnings report, Nvidias stock price opened above $1,000 on Thursday morning. The chipmakers shares climbed 11% to about $1,053 during mid-day tradi… [+3211 chars]"
    },
    {
        "title": "Nvidia stock retreats from record high ahead of crucial first quarter earnings report",
        "date": "2024-05-22T13:38:13Z",
        "source": "Yahoo Entertainment",
        "text": "If you click 'Accept all', we and our partners, including 238 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+678 chars]"
    },
    {
        "title": "Nvidia stock reaches all-time high, crosses $3 trillion market cap for first time",
        "date": "2024-06-05T19:12:07Z",
        "source": "Yahoo Entertainment",
        "text": "If you click 'Accept all', we and our partners, including 238 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+678 chars]"
    },
    {
        "title": "Nvidia’s profits soar as AI boom shows no sign of slowing down",
        "date": "2024-05-23T03:08:55Z",
        "source": "Al Jazeera English",
        "text": "Nvidia, the chipmaker at the centre of the boom in artificial intelligence (AI), has reported a seven-fold jump in profit, sending its stock to a record high.\r\nThe Santa Clara, California-based compa… [+1673 chars]"
    },
    {
        "title": "Nvidia CEO Jensen Huang's compensation jumped 60% amid the AI boom",
        "date": "2024-05-15T04:56:00Z",
        "source": "Quartz India",
        "text": "Nvidia has been on a hot streak so far this year and its chief executive is headed for compensation outpacing his chip rivals. \r\nCEO Jensen Huang earned $34.2 million in total compensation for fiscal… [+2056 chars]"
    },
    {
        "title": "Microsoft Copilot To Use GPT-4o - CNET",
        "date": "2024-05-20T19:23:06Z",
        "source": "CNET",
        "text": "Copilot, Microsoft's AI assistant in Windows 11 and Bing, will begin using GPT-4o, the latest technology that's also powering the paid tier of ChatGPT, the company said at its AI Era event in Seattle… [+2109 chars]"
    },
    {
        "title": "Should You Buy Palantir Stock Instead of Nvidia Stock?",
        "date": "2024-05-30T10:58:05Z",
        "source": "Biztoc.com",
        "text": "Fool.com contributor Parkev Tatevosian compares Palantir (NYSE: PLTR) and Nvidia (NASDAQ: NVDA) to determine the better buy for long-term investors.*Stock prices used were the afternoon prices of May… [+284 chars]"
    },
    {
        "title": "Dell Escapes Nvidia’s Shadow as Its Own AI Tailwinds Accelerate",
        "date": "2024-05-30T13:38:20Z",
        "source": "Yahoo Entertainment",
        "text": "(Bloomberg) -- Dell Technologies Inc. shares have been acting like market-leader Nvidia Corp. of late, and investors are betting the company will see a similar boost from artificial intelligence.\r\nMo… [+5860 chars]"
    },
    {
        "title": "Nvidia's market cap briefly surpassed Apple — and they both hit the $3 trillion mark",
        "date": "2024-06-05T19:40:00Z",
        "source": "Quartz India",
        "text": "Nvidia on Wednesday briefly surpassed Apple in total market capitalization, as both companies crossed the $3 trillion threshold. Now the companies trail only Microsoft, which has a $3.14 trillion mar… [+2795 chars]"
    },
    {
        "title": "Nvidia boosts Nasdaq to record high, but the Dow loses over 500 points",
        "date": "2024-05-23T18:18:00Z",
        "source": "Quartz India",
        "text": "A better-than-expected earnings report from Nvidia led the Nasdaq to a new high today, but the stock market struggled overall, with Dow Jones falling over 600 points. Meanwhile, Federal Reserve offic… [+2088 chars]"
    },
    {
        "title": "Google comes for Microsoft, Mark Zuckerberg wants AI advice, and Nvidia shines: Tech news roundup",
        "date": "2024-05-24T09:00:00Z",
        "source": "Quartz India",
        "text": "This week in tech, Nvidia proved that its stock can in fact go higher surpassing $1,000 per share, as the most bullish analysts had expected since the beginning of the year. \r\nMeanwhile, sluggish iPh… [+219 chars]"
    },
    {
        "title": "Stock market today: Dow plunges 605 points as fresh economic data clouds outlook for rate cuts",
        "date": "2024-05-23T20:09:55Z",
        "source": "Business Insider",
        "text": "US stocks closed sharply lower on Thursday, with Nvidia's earnings in the rearview and traders dealing with fresh fears of sticky inflation and high interest rates. \r\nNvidia shares soared on Thursday… [+1476 chars]"
    },
    {
        "title": "Nvidia earnings are coming but the rally can't continue forever, strategist says",
        "date": "2024-05-15T16:27:00Z",
        "source": "Quartz India",
        "text": "Steve Sosnick, chief strategist of Interactive Brokers, spoke with Quartz for the latest installment of our Smart Investing video series.\r\nWatch the interview above and check out the transcript below… [+3337 chars]"
    },
    {
        "title": "3 Brilliant Reasons to Buy Nvidia Stock Before Its Stock Split",
        "date": "2024-05-28T18:30:09Z",
        "source": "Biztoc.com",
        "text": "The last time Nvidia announced a split, the stock ran up 20% in two months.Nvidia (NVDA 6.91%) last split its stock in 2021, a 4-for-1 split to reduce its $600 share price to around $150. Now, due to… [+233 chars]"
    },
    {
        "title": "Nvidia and chip rival AMD announce next-generation AI chips",
        "date": "2024-06-03T14:04:00Z",
        "source": "Quartz India",
        "text": "Nvidia unveiled its highly-anticipated artificial intelligence chip platform, Blackwell, in March, and already has its successors lined up.\r\nChief executive Jensen Huang announced the Blackwell Ultra… [+1417 chars]"
    },
    {
        "title": "Nvidia, Target, and Bitcoin pizza: What to watch in the markets this week",
        "date": "2024-05-19T09:00:00Z",
        "source": "Quartz India",
        "text": "What an exceptional week it has been for the stock market. The Dow crossed the 40,000 mark for the first time in its 128-year history, and the S&amp;P 500 and Nasdaq reached their peaks on the same d… [+3414 chars]"
    },
    {
        "title": "Forget Nvidia, This Is the Only AI Stock You Need",
        "date": "2024-05-17T23:00:06Z",
        "source": "Biztoc.com",
        "text": "This stock is cheaper than Nvidia, has more growth potential, and will also grow as Nvidia's most critical supplier.Nvidia (NVDA -1.99%) is the biggest name in artificial intelligence, but the future… [+296 chars]"
    },
    {
        "title": "Nvidia CEO Expects AI Video to Create Yet More Demand for Computer Chips",
        "date": "2024-05-24T11:38:50Z",
        "source": "PetaPixel",
        "text": "The past 12 months have seen artificial intelligence computing company Nvidia go stratospheric as the generative AI boom saw it become one of the most valuable companies in the world. And CEO Jensen … [+2098 chars]"
    },
    {
        "title": "Amazon CEO's keys to success, Nvidia CEO's net worth, a banker stays home: Leadership news roundup",
        "date": "2024-05-25T13:00:00Z",
        "source": "Quartz India",
        "text": "While CEOs across the banking industry have been pushing for their employees to return to the office, the head of Santander Bank says he only took the job because of the work-from-home flexibility. \r… [+932 chars]"
    },
    {
        "title": "The S&P 500 and the Nasdaq hit all-time highs as inflation slows and interest rate cut hopes persist",
        "date": "2024-05-15T14:06:00Z",
        "source": "Quartz India",
        "text": "The S&amp;P 500 and the Nasdaq both reached all-time highs for the stock indexes Wednesday morning, as new data showed inflation slowing slightly and in line with expectations. \r\nMeanwhile, the Dow J… [+2141 chars]"
    },
    {
        "title": "Nvidia Stock Hits New All-Time High Ahead Of 10-For-1 Split",
        "date": "2024-06-05T14:49:34Z",
        "source": "Forbes",
        "text": "Nvidia shares just hit their highest price ever, but they are about to get a whole lot cheaper, and, no, that's not some bold prognostication for the worlds hottest stock: the artificial intelligence… [+3478 chars]"
    },
    {
        "title": "Nvidia earnings have Wall Street holding its breath. Here's what to expect",
        "date": "2024-05-17T20:47:46Z",
        "source": "Quartz India",
        "text": "After unveiling its highly anticipated new chip, Blackwell, in March, Nvidia is set to report its first quarter earnings on Wednesday and its share price could reach an all-time high.\r\nNvidias shares… [+2754 chars]"
    },
    {
        "title": "Analysts overhaul Nvidia stock price targets ahead of earnings",
        "date": "2024-05-13T12:40:08Z",
        "source": "Biztoc.com",
        "text": "Nvidia shares edged higher in early Monday trading after a pair of analysts issued big price target changes on the AI tech giant ahead of its highly anticipated first-quarter-earnings report on May 2… [+274 chars]"
    },
    {
        "title": "Better Artificial Intelligence (AI) Stock: Nvidia vs. Super Micro Computer",
        "date": "2024-05-10T09:46:05Z",
        "source": "Biztoc.com",
        "text": "Nvidia (NASDAQ: NVDA) and Super Micro Computer (NASDAQ: SMCI) have been big winners on the stock market in the past year, delivering stunning gains as their revenue and earnings growth soared thanks … [+315 chars]"
    },
    {
        "title": "Who Owns the Most Nvidia Stock Besides CEO Jensen Huang?",
        "date": "2024-05-24T08:54:06Z",
        "source": "Biztoc.com",
        "text": "It should come as no surprise that Jensen Huang is the largest individual shareholder of Nvidia (NASDAQ: NVDA). He co-founded the company with friends back in 1993 and currently serves as its preside… [+312 chars]"
    },
    {
        "title": "Should You Invest $1,000 in Nvidia Stock Right Now?",
        "date": "2024-06-06T12:14:06Z",
        "source": "Biztoc.com",
        "text": "Nvidia is the talk of the town in the US stock market as its market cap surpassed $3 trillion on Wednesday. It briefly topped Apple and continues its phenomenal rise in the markets being among the to… [+283 chars]"
    },
    {
        "title": "Missed Out on Nvidia Stock? Buy This Spectacular Artificial Intelligence (AI) Stock Instead",
        "date": "2024-06-07T08:54:06Z",
        "source": "Biztoc.com",
        "text": "Fool.com contributor Parkev Tatevosian highlights one excellent artificial intelligence stock for investors who feel it is too late to buy Nvidia (NASDAQ: NVDA) stock.*Stock prices used were the afte… [+268 chars]"
    },
    {
        "title": "Nvidia hits $1,000 mark post earnings beat and stock split",
        "date": "2024-05-23T06:34:09Z",
        "source": "Biztoc.com",
        "text": "Nvidia reported April-quarter earnings that topped market forecasts. The chipmaker announced a 10-for-1 stock split as the share price surpassed $1,000.Nvidia, the leading chipmaker, reported robust … [+293 chars]"
    },
    {
        "title": "Stock splits: The strange exception where a lower stock price can be better for investors",
        "date": "2024-06-03T21:50:09Z",
        "source": "Biztoc.com",
        "text": "NEW YORK -- In some rare cases, a lower stock price can actually be a boon for investors.Consider Nvidia, the chip company whose stock price has soared well above $1,000 as Wall Street's frenzy aroun… [+298 chars]"
    },
    {
        "title": "Elon Musk Is Hurting Tesla To Help Twitter and xAI",
        "date": "2024-06-04T16:00:00Z",
        "source": "Jalopnik",
        "text": "It really seems like Tesla CEO Elon Musk is pushing his automakers needs by the wayside in favor of Twitter and his artificial intelligence company, xAI. It also looks as if Musk is going back on his… [+4101 chars]"
    },
    {
        "title": "Nvidia Stock Slips As Wall Street Awaits Blockbuster Earnings",
        "date": "2024-05-21T14:51:06Z",
        "source": "Forbes",
        "text": "Nvidia stock slumped Tuesday ahead of its hotly anticipated earnings report due this week, as the top investor pick for artificial intelligence grapples with sky-high expectations. \r\nNvidia CEO Jense… [+2502 chars]"
    },
    {
        "title": "Nvidia Stock Hits Record High Ahead Of Blockbuster Earnings",
        "date": "2024-05-21T20:09:24Z",
        "source": "Forbes",
        "text": "Nvidia stock closed at a new all-time high Tuesday ahead of its hotly anticipated earnings report due this week, as the top investor pick for artificial intelligence grapples with sky-high expectatio… [+2723 chars]"
    },
    {
        "title": "Nvidia Was Key To Success In My Stock-Picking Derby",
        "date": "2024-05-13T14:00:00Z",
        "source": "Forbes",
        "text": "Nvidia headquarters in Santa Clara, California. In my annual stock-picking derby, contestants who ... [+] picked Nvidia were among the top finishers. (Photo by Justin Sullivan/Getty Images)\r\nGetty Im… [+4428 chars]"
    }
]